In [41]:
import pandas as pd

In [42]:

training = pd.read_csv('titanic.csv')

In [43]:
#Code cell 1
#import pandas
#muestra la informacion del contenido del dataframe de pandas.
training.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
pclass       1309 non-null int64
survived     1309 non-null int64
name         1309 non-null object
sex          1309 non-null object
age          1046 non-null float64
sibsp        1309 non-null int64
parch        1309 non-null int64
ticket       1309 non-null object
fare         1308 non-null float64
cabin        295 non-null object
embarked     1307 non-null object
boat         486 non-null object
body         121 non-null float64
home.dest    745 non-null object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [44]:
#muestra las primeras lineas de la data..

training.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [45]:
#Reemplaza los valores 'male' por cero
training["sex"] = training["sex"].apply(lambda toLabel: 0 if toLabel == 'male' else 1)

In [46]:
training.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",1,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",0,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",1,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",0,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [47]:
#verificamos cuantos nulos hay en cada columna de dataframe
missing_values_count = training.isnull().sum()

In [48]:
#
missing_values_count[0:15]

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [49]:
#Reemplaza los vacios por la media de la edad.
training["age"].fillna(training["age"].mean(), inplace=True)

In [50]:
#muestra la data
training.describe()

,pclass,survived,sex,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1309.000000,1309.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,0.355997,29.881138,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,0.478997,12.883193,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.000000,0.170000,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,0.000000,22.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,0.000000,29.881138,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,1.000000,35.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

In [51]:
training["age"].mean()

29.88113766730398

In [52]:
#borrar columnas
del training['body']

In [53]:
training.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 13 columns):
pclass       1309 non-null int64
survived     1309 non-null int64
name         1309 non-null object
sex          1309 non-null int64
age          1309 non-null float64
sibsp        1309 non-null int64
parch        1309 non-null int64
ticket       1309 non-null object
fare         1308 non-null float64
cabin        295 non-null object
embarked     1307 non-null object
boat         486 non-null object
home.dest    745 non-null object
dtypes: float64(2), int64(5), object(6)
memory usage: 133.1+ KB

In [54]:
#variable objetivo
y= training["survived"]

In [55]:
del training['cabin']

In [56]:
del training["boat"]

In [57]:
missing_values_count[0:15]

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [58]:
training.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",1,29.00,0,0,24160,211.3375,S,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",0,0.92,1,2,113781,151.5500,S,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",1,2.00,1,2,113781,151.5500,S,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",0,30.00,1,2,113781,151.5500,S,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,25.00,1,2,113781,151.5500,S,"Montreal, PQ / Chesterville, ON"

In [59]:
training.describe()

,pclass,survived,sex,age,sibsp,parch,fare
count,1309.000000,1309.000000,1309.000000,1309.000000,1309.000000,1309.000000,1308.000000
mean,2.294882,0.381971,0.355997,29.881138,0.498854,0.385027,33.295479
std,0.837836,0.486055,0.478997,12.883193,1.041658,0.865560,51.758668
min,1.000000,0.000000,0.000000,0.170000,0.000000,0.000000,0.000000
25%,2.000000,0.000000,0.000000,22.000000,0.000000,0.000000,7.895800
50%,3.000000,0.000000,0.000000,29.881138,0.000000,0.000000,14.454200
75%,3.000000,1.000000,1.000000,35.000000,1.000000,0.000000,31.275000
max,3.000000,1.000000,1.000000,80.000000,8.000000,9.000000,512.329200

In [60]:
#Cambiamos los valores a categorias representados
training["embarked"].replace(['Q','S','C'], [0,1,2], inplace=True)

In [61]:
# rellena los nulos por la media (mean)
training["embarked"].fillna(training["embarked"].replace('0'), inplace=True)

In [62]:
Y= training["survived"]

In [63]:
training = training.dropna()

In [64]:
#Creamos los grupos de edades
bins = [0, 8, 15, 18, 25, 40, 60, 100]
names =['1', '2', '3', '4', '5', '6', '7']
training["age"]=pd.cut(training["age"],bins, labels = names)

In [65]:
training.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",1,5,0,0,24160,211.3375,1.0,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",0,1,1,2,113781,151.5500,1.0,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",1,1,1,2,113781,151.5500,1.0,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",0,5,1,2,113781,151.5500,1.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,4,1,2,113781,151.5500,1.0,"Montreal, PQ / Chesterville, ON"

In [66]:
del training['sibsp']
del training['parch']
del training['home.dest']
del training['name']
del training['ticket']

In [67]:
training.head()

   pclass  survived  sex age      fare  embarked
0       1         1    1   5  211.3375       1.0
1       1         1    0   1  151.5500       1.0
2       1         0    1   1  151.5500       1.0
3       1         0    0   5  151.5500       1.0
4       1         0    1   4  151.5500       1.0

In [68]:
training.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 744 entries, 0 to 1281
Data columns (total 6 columns):
pclass      744 non-null int64
survived    744 non-null int64
sex         744 non-null int64
age         744 non-null category
fare        744 non-null float64
embarked    744 non-null float64
dtypes: category(1), float64(2), int64(3)
memory usage: 36.0 KB

In [69]:
del training['fare']

In [70]:
training.head()

   pclass  survived  sex age  embarked
0       1         1    1   5       1.0
1       1         1    0   1       1.0
2       1         0    1   1       1.0
3       1         0    0   5       1.0
4       1         0    1   4       1.0

In [71]:
#Quitar solo un campo
x_input = training.drop(['survived'], axis=1)

In [72]:
x.head()

NameError: name 'x' is not defined

In [73]:
# Separando el conjunto de datos en 2 grupos entrenamient (train) y prueba (test)
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x_input, y, test_size=0.30) # el 0.30 es el porcentje de separacion

ValueError: Found input variables with inconsistent numbers of samples: [744, 1309]

In [33]:
#Definimos Modelo (regresion logistica es un modelo de clasificacion que trabaja con variables categoricas)
from sklearn.linear_model import LogisticRegression
#entrenamos el modelo
model = LogisticRegression()
model.fit(x_train,y_train)

NameError: name 'x_train' is not defined

In [32]:
#realizamos la prediccion sobre el conjunto de entrenamien
predictions1= model.predict (x,train)
#predictios
predictions1

NameError: name 'x' is not defined

In [0]:
#lectura el coefiiente de determinacion R2 de la prediccion. se define como la prporion de la

In [81]:
training.fillna('0')

ValueError: fill value must be in categories